[
  {
    "id": "1",
    "categoryId": "01",
    "rating": {
      "number": 4.5
    },
    "views": 675,
    "title": "Learn HTML From Explore Tech",
    "author": {
      "name": "Explore Tech",
      "published_date": "20-10-2022",
      "img": "https://i.ibb.co/vqRJJzZ/rsz-35-01-01-02.jpg"
    },
    "image": "https://i.ibb.co/nQ74Xbh/html.png",
    "note": "About this course",
    "details": "HTML stands for HyperText Markup Language, which can be a confusing term for many beginners. The best way to explain HTML is to examine the meaning of each word. HTML (HyperText Markup Language) is the code that is used to structure a web page and its content. For example, content could be structured within a set of paragraphs, a list of bulleted points, or using images and data tables HTML is the standard markup language for Web pages. With HTML you can create your own Website. HTML is easy to learn - You will enjoy it. Fun fact: all websites use HTML — even this one. It's a fundamental part of every web developer's toolkit. HTML provides the content that gives web pages structure, by using elements and tags, you can add text, images, videos, forms, and more. Learning HTML basics is an important first step in your web development journey and an essential skill for front- and back-end developers. Fun fact: all websites use HTML — even this one. It's a fundamental part of every web developer's toolkit. HTML provides the content that gives web pages structure, by using elements and tags, you can add text, images, videos, forms, and more. Learning HTML basics is an important first step in your web development journey and an essential skill for front- and back-end developers.",
    "price": "$99"
  },
  {
    "id": "2",
    "categoryId": "02",
    "rating": {
      "number": 4.5
    },
    "views": 675,
    "title": "Learn CSS From Explore Tech",
    "author": {
      "name": "Explore Tech",
      "published_date": "20-10-2022",
      "img": "https://i.ibb.co/vqRJJzZ/rsz-35-01-01-02.jpg"
    },
    "image": "https://i.ibb.co/MG1mhDK/css.png",
    "note": "About this course",
    "details": "This course breaks down the fundamentals of CSS into digestible, easy to understand pieces. Over the next few modules, you'll learn how the core aspects of CSS work and how to use them effectively in your projects. Use the menu pane by the Learn CSS logo to navigate the modules. You'll learn CSS fundamentals like the box model, cascade and specificity, flexbox, grid and z-index. And, along with these fundamentals, you'll learn about functions, color types, gradients, logical properties and inheritance to make you a well-rounded front-end developer, ready to take on any user interface. Each module is full of interactive demos and self-assessments for you to test your knowledge. In addition to learning through reading and demos, there is an accompanying podcast episode for each topic as another way to learn and continue expanding your knowledge. This course is created for beginner and advanced CSS developers alike. You can go through the series from start to finish to get a general understanding of CSS from top to bottom, or you can use it as a reference for specific styling subjects. For those new to web development overall, check out the intro to HTML course from MDN to learn all about how to write markup and link your stylesheets.. If you have ever wanted to build and design stylish, responsive websites, this introductory CSS training course can help you get started learning CSS for web design and development. Designed for beginners, no prior experience with CSS is required to get the most out of this online course.",
    "price": "$99"
  },
  {
    "id": "3",
    "categoryId": "03",
    "rating": {
      "number": 4.5
    },
    "views": 675,
    "title": "Learn Plain JavaScript From Explore Tech",
    "author": {
      "name": "Explore Tech",
      "published_date": "20-10-2022",
      "img": "https://i.ibb.co/vqRJJzZ/rsz-35-01-01-02.jpg"
    },
    "image": "https://i.ibb.co/t4nH3J7/js-file.png",
    "note": "About this course",
    "details": "JavaScript is a lightweight, interpreted programming language. It is designed for creating network-centric applications. It is complimentary to and integrated with Java. JavaScript is very easy to implement because it is integrated with HTML. It is open and cross-platform. VanillaJS is a name to refer to using plain JavaScript without any additional libraries like jQuery back in the days. People use it as a joke to remind other developers that many things can be done nowadays without the need for additional JavaScript libraries. Javascript is a MUST for students and working professionals to become a great Software Engineer specially when they are working in Web Development Domain. I will list down some of the key advantages of learning Javascript. Javascript is the most popular programming language in the world and that makes it a programmer's great choice. Once you learnt Javascript, it helps you developing great front-end as well as back-end softwares using different Javascript based frameworks like jQuery, Node.JS etc. Javascript is everywhere, it comes installed on every modern web browser and so to learn Javascript you really do not need any special environment setup. For example Chrome, Mozilla Firefox , Safari and every browser you know as of today, supports Javascript. Javascript helps you create really beautiful and crazy fast websites. You can develop your website with a console like look and feel and give your users the best Graphical User Experience.",
    "price": "$149"
  },
  {
    "id": "4",
    "categoryId": "04",
    "rating": {
      "number": 4.5
    },
    "views": 675,
    "title": "Learn ReactJS From Explore Tech",
    "author": {
      "name": "Explore Tech",
      "published_date": "20-10-2022",
      "img": "https://i.ibb.co/vqRJJzZ/rsz-35-01-01-02.jpg"
    },
    "image": "https://i.ibb.co/0XdJmTB/reactJS.png",
    "note": "About this course",
    "details": "The React. js framework is an open-source JavaScript framework and library developed by Facebook. It's used for building interactive user interfaces and web applications quickly and efficiently with significantly less code than you would with vanilla JavaScript. React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes. Declarative views make your code more predictable and easier to debug. Build encapsulated components that manage their own state, then compose them to make complex UIs. Since component logic is written in JavaScript instead of templates, you can easily pass rich data through your app and keep state out of the DOM. We don't make assumptions about the rest of your technology stack, so you can develop new features in React without rewriting existing code. React can also render on the server using Node and power mobile apps using React Native. React has been designed from the start for gradual adoption, and you can use as little or as much React as you need. Whether you want to get a taste of React, add some interactivity to a simple HTML page, or start a complex React-powered app, the links in this section will help you get started. People come to React from different backgrounds and with different learning styles. Whether you prefer a more theoretical or a practical approach, we hope you'll find this section helpful. If you prefer to learn by doing, start with our practical tutorial. If you prefer to learn concepts step by step, start with our guide to main concepts.",
    "price": "$169"
  },
  {
    "id": "5",
    "categoryId": "05",
    "rating": {
      "number": 4.5
    },
    "views": 675,
    "title": "Learn NodeJS From Explore Tech",
    "author": {
      "name": "Explore Tech",
      "published_date": "20-10-2022",
      "img": "https://i.ibb.co/vqRJJzZ/rsz-35-01-01-02.jpg"
    },
    "image": "https://i.ibb.co/jMhxBYt/nodejs-logo.jpg",
    "note": "About this course",
    "details": "It is used for server-side programming, and primarily deployed for non-blocking, event-driven servers, such as traditional web sites and back-end API services, but was originally designed with real-time, push-based architectures in mind. The API reference documentation provides detailed information about a function or object in Node.js. This documentation indicates what arguments a method accepts, the return value of that method, and what errors may be related to that method. It also indicates which methods are available for different versions of Node.js. This documentation describes the built-in modules provided by Node.js. It does not document modules provided by the community. The ES6 section describes the three ES6 feature groups, and details which features are enabled by default in Node.js, alongside explanatory links. It also shows how to find which version of V8 shipped with a particular Node.js release. As an asynchronous event-driven JavaScript runtime, Node.js is designed to build scalable network applications. In the following hello world example, many connections can be handled concurrently. Upon each connection, the callback is fired, but if there is no work to be done, Node.js will sleep. Node.js being designed without threads doesn't mean you can't take advantage of multiple cores in your environment. Child processes can be spawned by using our child_process.fork() API, and are designed to be easy to communicate with. Built upon that same interface is the cluster module, which allows you to share sockets between processes to enable load balancing over your cores.",
    "price": "$149"
  },
  {
    "id": "6",
    "categoryId": "06",
    "rating": {
      "number": 4.5
    },
    "views": 675,
    "title": "Learn MongoDB From Explore Tech",
    "author": {
      "name": "Explore Tech",
      "published_date": "20-10-2022",
      "img": "https://i.ibb.co/vqRJJzZ/rsz-35-01-01-02.jpg"
    },
    "image": "https://i.ibb.co/WzrCjMT/mdb.jpg",
    "note": "About this course",
    "details": "MongoDB is a document database used to build highly available and scalable internet applications. With its flexible schema approach, it's popular with development teams using agile methodologies. MongoDB Atlas makes it easier for us to handle data. We don't have to pre-provision giant databases, and our developers can easily get access to world-class infrastructure as they need it. MongoDB is an open-source document database and leading NoSQL database. MongoDB is written in C++. This tutorial will give you great understanding on MongoDB concepts needed to create and deploy a highly scalable and performance-oriented database. This tutorial is designed for Software Professionals who are willing to learn MongoDB Database in simple and easy steps. It will throw light on MongoDB concepts and after completing this tutorial you will be at an intermediate level of expertise, from where you can take yourself at higher level of expertise. Before proceeding with this tutorial, you should have a basic understanding of database, text editor and execution of programs, etc. Because we are going to develop high performance database, so it will be good if you have an understanding on the basic concepts of Database (RDBMS). MongoDB is an open-source document database and leading NoSQL database. MongoDB is written in C++. This tutorial will give you great understanding on MongoDB concepts needed to create and deploy a highly scalable and performance-oriented database. This tutorial is designed for Software Professionals who are willing to learn MongoDB Database in simple and easy steps. It will throw light on MongoDB concepts and after completing this tutorial you will be at an intermediate level of expertise, from where you can take yourself at higher level of expertise.",
    "price": "$199"
  }
]